tutorials/multiphase/vof/vofLPTSolver/ACCM_bubbleCol3D/0/U
/*---------------------------------------------------------------------------*
Caelus 7.04
Web:   www.caelus-cml.com
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    top
    {
        type            slip;
    }
    bottom
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    sidewalls
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    inlet
    {
        type            slip;
    }
}


// ************************************************************************* //
