tutorials/multiphase/vof/vofLPTSolver/ACCM_bubbleCol3D/system/sampleDict
/*---------------------------------------------------------------------------*
Caelus 7.04
Web:   www.caelus-cml.com
\*---------------------------------------------------------------------------*/

FoamFile
{
    version         2.0;
    format          ascii;
    class           dictionary;
    location        system;
    object          sampleDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

setFormat raw;

surfaceFormat vtk;

interpolationScheme cellPointFace;

// Fields to sample.
fields
(
	U
	UMean
    UPrime2Mean
);

sets
(
	linex_ym005
	{
		type uniform;
		axis x;
		start (-0.075  0.05 0.0);
		end   ( 0.075  0.05 0.0);
		nPoints 50;
	}
	linex_ym010
	{
		type uniform;
		axis x;
		start (-0.075  0.10 0.0);
		end   ( 0.075  0.10 0.0);
		nPoints 50;
	}
	linex_ym015
	{
		type uniform;
		axis x;
		start (-0.075  0.15 0.0);
		end   ( 0.075  0.15 0.0);
		nPoints 50;
	}
	linex_ym020
	{
		type uniform;
		axis x;
		start (-0.075  0.20 0.0);
		end   ( 0.075  0.20 0.0);
		nPoints 50;
	}
	linex_ym025
	{
		type uniform;
		axis x;
		start (-0.075  0.25 0.0);
		end   ( 0.075  0.25 0.0);
		nPoints 50;
	}
	linex_ym030
	{
		type uniform;
		axis x;
		start (-0.075  0.30 0.0);
		end   ( 0.075  0.30 0.0);
		nPoints 50;
	}
	linex_ym035
	{
		type uniform;
		axis x;
		start (-0.075  0.35 0.0);
		end   ( 0.075  0.35 0.0);
		nPoints 50;
	}
	linex_ym040
	{
		type uniform;
		axis x;
		start (-0.075  0.40 0.0);
		end   ( 0.075  0.40 0.0);
		nPoints 50;
	}
	linex_ym045
	{
		type uniform;
		axis x;
		start (-0.075  0.449 0.0);
		end   ( 0.075  0.449 0.0);
		nPoints 50;
	}
	linez_ym005
	{
		type uniform;
		axis z;
		start (0.0  0.05 -0.075);
		end   (0.0  0.05  0.075);
		nPoints 50;
	}
	linez_ym010
	{
		type uniform;
		axis z;
		start (0.0  0.10 -0.075);
		end   (0.0  0.10  0.075);
		nPoints 50;
	}
	linez_ym015
	{
		type uniform;
		axis z;
		start (0.0  0.15 -0.075);
		end   (0.0  0.15  0.075);
		nPoints 50;
	}
	linez_ym020
	{
		type uniform;
		axis z;
		start (0.0  0.20 -0.075);
		end   (0.0  0.20  0.075);
		nPoints 50;
	}
	linez_ym025
	{
		type uniform;
		axis z;
		start (0.0  0.25 -0.075);
		end   (0.0  0.25  0.075);
		nPoints 50;
	}
	linez_ym030
	{
		type uniform;
		axis z;
		start (0.0  0.30 -0.075);
		end   (0.0  0.30  0.075);
		nPoints 50;
	}
	linez_ym035
	{
		type uniform;
		axis z;
		start (0.0  0.35 -0.075);
		end   (0.0  0.35  0.075);
		nPoints 50;
	}
	linez_ym040
	{
		type uniform;
		axis z;
		start (0.0  0.40 -0.075);
		end   (0.0  0.40  0.075);
		nPoints 50;
	}
	linez_ym045
	{
		type uniform;
		axis z;
		start (0.0  0.449 -0.075);
		end   (0.0  0.449  0.075);
		nPoints 50;
	}
);

surfaces
(
);

